src/Documents/ЗаявкаНаУценку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ЗаявкаНаУценку</Name>
			<Comment>Заявка на уценку</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДокументов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Comment>Дата начала действия цены</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОконачанияДействия</Name>
					<Comment>Дата начала действия цены</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласоватьВсё</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Скидки</Name>
					<Comment>Таблица скидок</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Товар или группа на которую действует скидка</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособВычисления</Name>
							<Comment>Способ вычисления скидки (относительная/абсолютная)</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.СкидкиСпособВычисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеСкидки</Name>
							<Comment>Значение скидки</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШтрихКод</Name>
							<Comment>Штрих-код</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаДействия</Name>
							<Comment>Дата начала действия цены</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОконачанияДействия</Name>
							<Comment>Дата начала действия цены</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкладКомпании</Name>
							<Comment>Склад/Отдел</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОкругления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыОкругления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>Единица измерения номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество единиц измерения номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Согласовано</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
					<Comment>Подразделения, для которых устанавливается цены</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПодразделениеКомпании</Name>
							<Comment>Подразделение компании для которого изменяется ассортимент данным документом</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УценкаТовара</Name>
					<Comment>Уценка товара</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаДействия</Name>
							<Comment>Дата начала действия цены</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОконачанияДействия</Name>
							<Comment>Дата начала действия цены</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
					<Comment>Набор реквизитов, состав которого определяется компанией</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ТоварыВОборудовании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ТоварыВОборудовании</Name>
			<Comment>Сведения о товарах которые выгружаются в оборудование</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерЯчейки</Name>
					<Comment>Номер ячейки PLU</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МоментИзменения</Name>
					<Comment>Момент последнего изменения товара. Если момент больше чем "момент последней загрузки" оборудования, то этот товар надо выгрузить в оборудование</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВыполненаПечатьЦенников</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ГруппаТоваров</Name>
					<Comment>Группа товаров оборудования</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыТоваровОборудования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Comment>Штрих-код</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/ЗаявкаНаУценку/Forms/ФормаСписка/Ext/Form/Module.bsl
// Модуль формы списка документа "Назначение скидок строки"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

// Обработчик события возникающего при нажатии программно добавленной кнопки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаКомандыФормыНаСервере(ИмяКоманды, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомДокументаСервер.ОбработкаКомандыФормы(ЭтотОбъект, ИмяКоманды, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаКомандыФормыНаСервере()

// Обработчик события возникающего при нажатии программно добавленной кнопки.
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаКомандыФормы(Команда) Экспорт
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомДокументаКлиент.ОбработкаКомандыФормы(ЭтотОбъект, Команда, Элементы.Список.ТекущиеДанные, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаКомандыФормыНаСервере(Команда.Имя, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // Подключаемый_ОбработкаКомандыФормы()

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаСервере
Процедура ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомДокументаСервер.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаРезультатаОповещенияНаСервере()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Вызываем общий обработчик события в контексте клиента
	Если НЕ УправлениеСпискомДокументаКлиент.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(РезультатОповещения);
	
КонецПроцедуры // Подключаемый_ОбработкаРезультатаОповещения()

// Отображает результат выполнения действия.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаКлиенте
Процедура ОбработкаРезультатаВыполненияДействия(ПараметрыДействия)
	
	// Вызываем общий обработчик результата выполнения действия
	УправлениеСпискомДокументаКлиент.ОбработкаРезультатаВыполненияДействия(ЭтотОбъект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаРезультатаВыполненияДействия()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ДИНАМИЧЕСКОГО СПИСКА ФОРМЫ

// Обработчик события возникающего на клиенте при двойном щелчке мыши (нажатии Enter) в ячейке таблицы "Список".
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ВыбраннаяСтрока      - Ссылка       - Значение выбранной строки.
//  Поле                 - ПолеФормы    - Активное поле.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	УправлениеСпискомДокументаКлиент.СписокВыбор(ЭтотОбъект, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
	
КонецПроцедуры // СписокВыбор()

// Обработчик события возникающего на клиенте при активизации строки списка с задержкой в контексте сервера.
//
&НаСервере
Процедура СписокПриАктивизацииСтрокиНаСервере()
	
	// Вызываем общий обработчик события
	УправлениеСпискомДокументаСервер.СписокПриАктивизацииСтроки(ЭтотОбъект, Элементы.Список);
	
КонецПроцедуры // СписокПриАктивизацииСтрокиНаСервере()

// Обработчик события возникающего на клиенте при активизации строки списка выполняемый с задержкой.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_СписокПриАктивизацииСтроки()
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомДокументаКлиент.СписокПриАктивизацииСтроки(ЭтотОбъект, Элементы.Список, ИСТИНА) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	СписокПриАктивизацииСтрокиНаСервере();
	
КонецПроцедуры // Подключаемый_СписокПриАктивизацииСтроки()

// Обработчик события возникающего на клиенте при активизации строки списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// Вызываем общий обработчик события
	УправлениеСпискомДокументаКлиент.СписокПриАктивизацииСтроки(ЭтотОбъект, Элемент);
	
КонецПроцедуры // СписокПриАктивизацииСтроки()

// Обработчик события возникающего на клиенте при активизации строки списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СписокПриАктивизацииЯчейки(Элемент)
	
	// Вызываем общий обработчик события
	УправлениеСпискомДокументаКлиент.СписокПриАктивизацииЯчейки(ЭтотОбъект, Элемент);
	
КонецПроцедуры // СписокПриАктивизацииЯчейки()

// Обработчик события возникающего на клиенте перед добавления строки в таблицу "Список".
//
// Параметры:
//  Элемент     - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ       - Булево       - Признак отказа от действия.
//  Копирование - Булево       - Определяет режим копирования.
//  Родитель    - Ссылка       - Ссылка на элемент, который будет использован при добавлении в качестве родителя.
//  Группа      - Булево       - Признак добавления группы.
//  Параметр    - Произвольный - Параметр команды, выполняемой при добавлении строки в таблицу.
//
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	// Вызываем общий обработчик события
	УправлениеСпискомДокументаКлиент.СписокПередНачаломДобавления(ЭтотОбъект, Элемент, Отказ, Копирование, Родитель, Группа, Параметр);
	
КонецПроцедуры // СписокПередНачаломДобавления

// Обработчик события возникающего на клиенте перед началом изменения списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от действия.
//
&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	// Вызываем общий обработчик события
	УправлениеСпискомДокументаКлиент.СписокПередНачаломИзменения(ЭтотОбъект, Элемент, Отказ);
	
КонецПроцедуры // СписокПередНачаломИзменения()

// Обработчик события возникающего на клиенте после удаления строки списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	
	// Вызываем общий обработчик события
	УправлениеСпискомДокументаКлиент.СписокПослеУдаления(ЭтотОбъект, Элемент);
	
КонецПроцедуры // СписокПослеУдаления()

// Обработчик события возникающего при сохранении пользовательских настроек в контексте сервера.
//
// Параметры:
//  Элемент   - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Настройки - ПользовательскиеНастройкиКомпоновкиДанных - Сохраняемые настройки. 
//
&НаСервере
Процедура СписокПриСохраненииПользовательскихНастроекНаСервере(Элемент, Настройки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомДокументаСервер.СписокПриСохраненииПользовательскихНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // СписокПриСохраненииПользовательскихНастроекНаСервере()

// Обработчик события возникающего при восстановлении пользовательских настроек в контексте сервера.
//
// Параметры:
//  Элемент   - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Настройки - ПользовательскиеНастройкиКомпоновкиДанных - Восстанавливаемые настройки.
//
&НаСервере
Процедура СписокПриЗагрузкеПользовательскихНастроекНаСервере(Элемент, Настройки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомДокументаСервер.СписокПриЗагрузкеПользовательскихНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // СписокПриЗагрузкеПользовательскихНастроекНаСервере()

// Обработчик события возникающего на сервере при обновлении пользовательских настроек списка.
//
// Параметры:
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	УправлениеСпискомДокументаСервер.СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(ЭтотОбъект, СтандартнаяОбработка);
	
КонецПроцедуры // СписокПриОбновленииСоставаПользовательскихНастроекНаСервере()

// Обработчик события вызывается на сервере после получения данных динамическим списком.
//
// Параметры:
//  ИмяЭлемента - Строка - Содержит имя таблицы формы, из которой вызван обработчик события.
//  Настройки   - НастройкиКомпоновкиДанных - Содержит копию полных настроек динамического списка.
//  Строки      - СтрокиДинамическогоСписка - Данные и оформление всех строк, получаемых в списке.
//
&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомДокументаСервер.СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки);
	
КонецПроцедуры // СписокПриПолученииДанныхНаСервере()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЯ РАСШИРЕННОЙ ИНФОРМАЦИИ

// Обработчик события возникающего на клиенте при нажатии на поле "Расширенная информация".
//
// Параметры:
//  Элемент              - ПолеФормы - Элемент управления, в котором возникло данное событие.
//  ДанныеСобытия        - ФиксированнаяСтруктура - Параметр заполняется фиксированной структурой со свойствами:
//                         Anchor, Element, Button, Event, Document, Href.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура РасширеннаяИнформацияПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	// Вызываем специальный обработчик события
	РасширеннаяИнформацияКлиент.ПриНажатии(ЭтотОбъект, Элемент, ДанныеСобытия, СтандартнаяОбработка);
	
КонецПроцедуры // РасширеннаяИнформацияПриНажатии()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомДокументаСервер.ПриСозданииНаСервере(ЭтотОбъект, Параметры, Отказ, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

// Обработчик события возникающего на клиенте при открытии формы, до показа окна пользователю.
//
// Параметры:
//  Отказ - Булево - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомДокументаКлиент.ПриОткрытии(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриОткрытии()

// Обработчик события возникающего на клиенте перед закрытием формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ЗавершениеРаботы     - Булево - Признак закрытия формы в процессе завершения работы приложения.
//  ТекстПредупреждения  - Булево - Сообщение пользователю не завершенной работе в данном окне.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомДокументаКлиент.ПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗакрытием()

// Обработчик события возникающего на клиенте при закрытии формы.
//
// Параметры:
//  ЗавершениеРаботы - Булево - Признак закрытия формы в процессе завершения работы приложения.
//
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомДокументаКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗакрытии()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить в контексте сервера.
//
// Параметры:
//  ИмяСобытия        - Строка    - Имя, идентифицирующее событие.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомДокументаСервер.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаОповещенияНаСервере()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить.
//
// Параметры:
//  ИмяСобытия - Строка       - Имя, идентифицирующее событие.
//  Параметр   - Произвольный - Параметр сообщения.
//  Источник   - Произвольный - Источник события.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Производим подготовку параметров события для обработки в контексте сервера
	Если НЕ УправлениеСпискомДокументаКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаОповещения()

// Обработчик события возникающего на клиенте при вызове метода ОповеститьОбАктивизации из формы-владельца.
//
// Параметры:
//  АктивныйОбъект - Произвольный     - Активный объект.
//  Источник       - УправляемаяФорма - Форма, источник сообщения.
//
&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомДокументаКлиент.ОбработкаАктивизации(ЭтотОбъект, АктивныйОбъект, Источник) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаАктивизации()

// Обработчик события возникающего на клиенте при записи объекта в одной из подчиненных форм.
//
// Параметры:
//  НовыйОбъект          - Произвольный     - Добавленный в подчиненной форме объект.
//  Источник             - УправляемаяФорма - Форма, источник сообщения.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомДокументаКлиент.ОбработкаЗаписиНового(ЭтотОбъект, НовыйОбъект, Источник, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаписиНового()

// Обработчик события возникающего на сервере при сохранении значений реквизитов и настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраняемых реквизитов и настроек формы.
//
&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомДокументаСервер.ПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // ПриСохраненииДанныхВНастройкахНаСервере()

// Обработчик события возникающего на сервере при восстановлении значений реквизитов из сохраненных настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраненных реквизитов и настроек формы.
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомДокументаСервер.ПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

&НаСервереБезКонтекста
Процедура ВыгрузитьУценкуВОборудованиеНаСервере(СписокДокументов, ТекстОшибки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	УценкаТовараПодразделения.Ссылка КАК Ссылка,
	|	УценкаТовараПодразделения.ПодразделениеКомпании КАК ПодразделениеКомпании
	|ПОМЕСТИТЬ
	|	УценкаТовараПодразделения
	|ИЗ
	|	Документ.УценкаТовара.Подразделения КАК УценкаТовараПодразделения
	|ГДЕ
	|	УценкаТовараПодразделения.Ссылка В (&Уценка)
	|
	|ОБЪЕДИНИТЬ 
	|
	|ВЫБРАТЬ
	|	ТаблицаУценкаТовара.Ссылка,
	|	ТаблицаУценкаТовара.ПодразделениеКомпании КАК ПодразделениеКомпании
	|ИЗ
	|	Документ.УценкаТовара КАК ТаблицаУценкаТовара
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Документ.УценкаТовара.Подразделения КАК УценкаТовараПодразделения
	|ПО
	|	УценкаТовараПодразделения.Ссылка = ТаблицаУценкаТовара.Ссылка
	|ГДЕ
	|	ТаблицаУценкаТовара.Ссылка В (&Уценка) И 
	|	УценкаТовараПодразделения.ПодразделениеКомпании ЕСТЬ NULL
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УценкаТовараПодразделения.Ссылка,
	|	ПодключаемоеОборудование.ГруппаТоваровОборудования КАК ГруппаТоваров
	|ПОМЕСТИТЬ
	|	ПодключаемоеОборудование
	|ИЗ
	|	УценкаТовараПодразделения КАК УценкаТовараПодразделения
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ПО
	|	ПодключаемоеОборудование.ОсновнойОтдел.ПодразделениеКомпании = УценкаТовараПодразделения.ПодразделениеКомпании
	|ГДЕ
	|	ПодключаемоеОборудование.ПометкаУдаления = ЛОЖЬ И 
	|	(НЕ ПодключаемоеОборудование.ГруппаТоваровОборудования = ЗНАЧЕНИЕ(Справочник.ГруппыТоваровОборудования.ПустаяСсылка))
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПодключаемоеОборудование.ГруппаТоваров КАК ГруппаТоваров,
	|	УценкаТовараСкидки.Номенклатура КАК Номенклатура,
	|	УценкаТовараСкидки.ШтрихКод КАК ШтрихКод
	|ПОМЕСТИТЬ
	|	УценкаТовараСкидки
	|ИЗ
	|	ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.УценкаТовара.Скидки КАК УценкаТовараСкидки
	|ПО
	|	ПодключаемоеОборудование.Ссылка = УценкаТовараСкидки.Ссылка
	|ГДЕ
	|	ПодключаемоеОборудование.Ссылка = УценкаТовараСкидки.Ссылка
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УценкаТовараСкидки.ГруппаТоваров КАК ГруппаТоваров,
	|	УценкаТовараСкидки.Номенклатура КАК Номенклатура
	|ИЗ
	|	УценкаТовараСкидки КАК УценкаТовараСкидки
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ТоварыВОборудовании КАК ТоварыВОборудовании
	|ПО
	|	УценкаТовараСкидки.ГруппаТоваров = ТоварыВОборудовании.ГруппаТоваров И 
	|	УценкаТовараСкидки.Номенклатура = ТоварыВОборудовании.Номенклатура И 
	|	ТоварыВОборудовании.ШтрихКод = """"
	|ГДЕ
	|	ТоварыВОборудовании.ГруппаТоваров ЕСТЬ NULL
	|ИТОГИ
	|ПО
	|	ГруппаТоваров
	|";
	
	Запрос.УстановитьПараметр("Уценка", СписокДокументов);
	
	ВыборкаГруппыТоваров = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаГруппыТоваров.Следующий() Цикл
		СписокТоваров = Новый Массив;
		Выборка = ВыборкаГруппыТоваров.Выбрать();
		Пока Выборка.Следующий() Цикл
			СписокТоваров.Добавить(Выборка.Номенклатура);
		КонецЦикла;
		Если СписокТоваров.Количество()>0 Тогда
			РегистрыСведений.ТоварыВОборудовании.ДобавитьТоварыВОборудование(ВыборкаГруппыТоваров.ГруппаТоваров, СписокТоваров);
		КонецЕсли;
	КонецЦикла;
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПодключаемоеОборудование.ГруппаТоваровОборудования КАК ГруппаТоваров
	|ПОМЕСТИТЬ
	|	ГруппыТоваровОборудования
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ГДЕ
	|	ПодключаемоеОборудование.ОсновнойОтдел.ПодразделениеКомпании В (&ПодразделенияКомпании)
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГруппыТоваровОборудования.ГруппаТоваров,
	|	ТаблицаСкидок.Номенклатура,
	|	ТаблицаСкидок.ШтрихКод
	|ПОМЕСТИТЬ
	|	ТаблицаСкидок
	|ИЗ
	|	Документ.УценкаТовара.Скидки КАК ТаблицаСкидок
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ГруппыТоваровОборудования КАК ГруппыТоваровОборудования
	|ПО
	|	ИСТИНА
	|ГДЕ
	|	ТаблицаСкидок.Ссылка В (&Уценка)
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаСкидок.Номенклатура,
	|	ТаблицаСкидок.ШтрихКод,
	|	ТаблицаСкидок.ГруппаТоваров КАК ГруппаТоваров,
	|	ТаблицаСкидок.ГруппаТоваров.ЗаполнятьПропуски КАК ЗаполнятьПропуски,
	|	МИНИМУМ(ВЫБОР
	|		КОГДА ТоварыВОборудовании.Штрихкод=ТаблицаСкидок.ШтрихКод ТОГДА
	|			ЛОЖЬ
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ) КАК НоваяЗапись,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА ТоварыВОборудовании.Штрихкод=ТаблицаСкидок.ШтрихКод ТОГДА
	|			ТоварыВОборудовании.НомерЯчейки
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ) КАК НомерЯчейки
	|ИЗ
	|	ТаблицаСкидок КАК ТаблицаСкидок
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ТоварыВОборудовании КАК ТоварыВОборудовании
	|ПО
	|	ТаблицаСкидок.ГруппаТоваров = ТоварыВОборудовании.ГруппаТоваров И 
	|	ТаблицаСкидок.Номенклатура = ТоварыВОборудовании.Номенклатура
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаСкидок.Номенклатура,
	|	ТаблицаСкидок.ШтрихКод,
	|	ТаблицаСкидок.ГруппаТоваров
	//|ИМЕЮЩИЕ
	//|	МИНИМУМ(ВЫБОР
	//|		КОГДА ТоварыВОборудовании.Штрихкод=ТаблицаСкидок.ШтрихКод ТОГДА
	//|			ЛОЖЬ
	//|		ИНАЧЕ
	//|			ИСТИНА
	//|	КОНЕЦ) = ИСТИНА
	|ИТОГИ ПО
	|	ГруппаТоваров
	|";
	
	
	Запрос.УстановитьПараметр("Уценка", СписокДокументов);
	
	МассивПодразделений = новый массив;
	Для каждого ДокументСсылка Из СписокДокументов Цикл
		МассивПодразделений.Добавить(ДокументСсылка.ПодразделениеКомпании);
	КонецЦикла; 
	Запрос.УстановитьПараметр("ПодразделенияКомпании", МассивПодразделений);
	
	ВыборкаПоГруппам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоГруппам.Следующий() Цикл
		НомерЯчейки = 0;
		КоличествоСвободныхЯчеек = 0;
		ГруппаТоваров     = ВыборкаПоГруппам.ГруппаТоваров;
		ЗаполнятьПропуски = ВыборкаПоГруппам.ЗаполнятьПропуски;
		
		// Наложим блокировку на считываемые данные
		СтруктураПараметровБлокировки = Новый Структура("ТипТаблицы, ИмяТаблицы", "РегистрСведений", "ТоварыВОборудовании");
		ЗначенияБлокировки = Новый Соответствие;
		ЗначенияБлокировки.Вставить("ГруппаТоваров", ГруппаТоваров);
		
		НачатьТранзакцию();
		
		Отказ = Ложь;
		ОбработкаСобытийДокументаСервер.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, ЗначенияБлокировки,,Отказ);
		Если Отказ Тогда
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;
		
		Если ЗаполнятьПропуски Тогда
			СвободныеНомераЯчеек = РегистрыСведений.ТоварыВОборудовании.ПолучитьСвободныеНомераЯчеек(ГруппаТоваров);
			КоличествоСвободныхЯчеек = СвободныеНомераЯчеек.Количество();
		Иначе
			НомерЯчейки = РегистрыСведений.ТоварыВОборудовании.ПолучитьМаксимальныйНомерЯчейки(ГруппаТоваров);
		КонецЕсли;
		ПередачаПослеПечати = ПолучитьЗначениеУчетнойПолитики(ПланыВидовХарактеристик.УчетныеПолитики.ПередачаВОборудованиеПослеПечати, Справочники.ГруппыТоваровОборудования.ПолучитьПодразделениеКомпанииПоГруппеТоваров(ГруппаТоваров));
		Выборка = ВыборкаПоГруппам.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			НоваяЗапись = РегистрыСведений.ТоварыВОборудовании.СоздатьМенеджерЗаписи(); 
			НоваяЗапись.ГруппаТоваров   = ГруппаТоваров;
			НоваяЗапись.Номенклатура    = Выборка.Номенклатура;
			НоваяЗапись.ШтрихКод        = Выборка.ШтрихКод;
			НоваяЗапись.МоментИзменения = ТекущаяДата();
			НоваяЗапись.ВыполненаПечатьЦенников = ?(ПередачаПослеПечати = Неопределено, Истина, НЕ ПередачаПослеПечати);
			
			Если Выборка.НоваяЗапись Тогда
				Если КоличествоСвободныхЯчеек>0 Тогда
					ТекущийИндекс = КоличествоСвободныхЯчеек-1;
					НомерЯчейки = СвободныеНомераЯчеек[ТекущийИндекс];
					СвободныеНомераЯчеек.Удалить(ТекущийИндекс);
					КоличествоСвободныхЯчеек=КоличествоСвободныхЯчеек-1;
				Иначе
					НомерЯчейки = НомерЯчейки+1;
				КонецЕсли;
				ТекНомерЯчейки = НомерЯчейки;
			Иначе
				ТекНомерЯчейки = Выборка.НомерЯчейки;
			КонецЕсли;
			
			НоваяЗапись.НомерЯчейки = ТекНомерЯчейки;
			
			Попытка
				НоваяЗапись.Записать();
			Исключение
				ОтменитьТранзакцию();
				Возврат;
			КонецПопытки;
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	КонецЦикла;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьТоварВОборудование(Команда)
	
	ВыгружаемыеТовары = Новый Массив;
	Если Элементы.Список.ВыделенныеСтроки.Количество() = 0 Тогда
		ВывестиСообщение(НСтр("ru='Документы для выгрузки не выделены.'"));
		Возврат;
	КонецЕсли;
	
	СписокДокументов = Новый Массив;
	Для Каждого ТекущаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		СписокДокументов.Добавить(ТекущаяСтрока);
	КонецЦикла;
	
	ТекстОшибки = "";
	ВыгрузитьУценкуВОборудованиеНаСервере(СписокДокументов, ТекстОшибки);
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ВывестиСообщение(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры
////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ
